[
{
    "id": "job-381816",
    "title": "Office Manager / Personal Assistant",
    "company": "connecterra",
    "department": "Operations",
    "location": "Amsterdam, Netherlands",
    "description": "<p>Connecterra is a diverse team of pioneers working to solve one of the hardest challenges the planet faces today: Agriculture Efficiency. We are the proud inventors of Ida, a digital assistant for farmers that uses data and machine learning to help support farmers and their stakeholders improve farm efficiency.<br></p>\n<p>Ida has demonstrated that she can help improve productivity by over 20% and is growing rapidly.. Learn more about Ida <a href=\"https://ida.io/\" rel=\"noopener\">here</a>.</p>\n<p>Headquartered in Amsterdam, The Netherlands, we operate in 18 countries globally. Check out our <a href=\"https://www.connecterra.io/downloads/\" rel=\"noopener\">press coverage</a> and I<a href=\"https://ida.io/stories/\" rel=\"noopener\">da growth track record</a>.<br></p>\n<p><br><strong>Our hiring ethos:</strong><br><br>We seek only the best and brightest who have a hunger to excel in their craft and will make a positive &amp; unique addition to our culture and team. Your attitude and commitment to working as a part of this team to come up with new ideas, solve problems and deliver results is what matters most to us.</p>\n<p>Our team is highly motivated, engaging, fun and supportive. We work as a team but hold each other accountable to our responsibilities.</p>\n<p>We offer you a platform to do the best work of your life, be involved with an interesting product and part of a unique, diverse and collaborative environment, your genuine desire to be an integral part of our mission means a lot to us.</p>\n<p><br></p>\n<p><strong>You're our new Office Manager:</strong></p>\n<p><strong><br></strong></p>\n<p>For our headquarters in Amsterdam we are looking for an enthusiastic and energetic Office Manager who relishes in the opportunity to wear multiple hats and be involved with the ins &amp; outs of Connecterra.</p>\n<p>Your main responsibility is to facilitate the smooth running of our Amsterdam 'office', this means not just the physical office but ensuring our team is looked after and working in the most productive and engaging environment possible. This role runs across not only office management, but IT requirements, support to our executive team, involvement in our social events as well as other random ad-hoc items that pop up from time to time.  </p>\n<p>This role would suit someone who likes to be involved across many areas of the business, is personable and able to communicate across all levels internally &amp; externally, can take on random challenges and adapt easily with a problem solving mindset.</p>\n<p><br></p>\n<p>It's possible this role could be done at 32 hours per week and while a lot of work can be done at home attendance to the office regularly will be required.</p>",
    "requirements": "<p><strong>Responsibilities</strong></p>\n<ul>\n\t<li>Supporting the management team with scheduling meetings, appointments/travel and filing of expenses</li>\n\t<li>Organising office operations, managing our team in office need-to-knows, liaising with our serviced office partner</li>\n<li>Preparing for new hires including working space allocation, welcome emails and IT equipment setup, liaising with our IT partner where needed</li>\n<li>Handling office administration, document management, filing, mail, company events/emails</li>\n\t<li>Monitoring inventory and ordering office, IT and kitchen stock</li>\n\t<li>The first point of contact for guests in the Amsterdam office</li>\n\t<li>Maintaining a tidy office environment</li>\n\t<li>Participating actively in the planning and execution of company events</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p>• Minimum of HBO education or equivalent experience</p>\n<p>• Minimum of two years working experience as an office assistant or similar role</p>\n<p>• Social character</p>\n<p>• Good self-organization and excellent planning &amp; time management skills</p>\n<p>• Problem solving &amp; can-do attitude</p>\n<p>• Excellent written and verbal communication in English. Dutch would be a bonus but not necessary.</p>\n<p>• Eligibility to work in the EU (for this specific role we will not be relocating)<br></p>\n<p><br></p>\n<p><strong>What we offer :</strong></p>\n<p>Every day we work hard on making the world a better place, thus the happiness and well-being of our team members is important to us. We currently offer the following:</p>\n<p><br></p>\n<ul>\n<li>A diverse, open minded, international and creative working environment where all are welcome</li>\n<li>Company pension</li>\n<li>Hybrid working environment: work where you want, when you want (you only need to be available in the office for company/team meetings, the rest of the time is up to you)</li>\n<li>Flexible working hours and vacation policy - we trust you and your time is yours to own. Work in an environment and on a schedule that suits you and your team best &amp; enjoy unlimited holiday days</li>\n<li>Quarterly company-wide Selfie Day - take a day on us to relax, do what you need to do to stay mentally healthy!</li>\n<li>The opportunity to play a vital role in an exciting start-up - we welcome your voice &amp; input</li>\n</ul>\n<ul><li>Fantastic office space in Amsterdam that is disability friendly with one of the best views of the Ij!<br><br>As we grow as a company this list will also grow.</li></ul>\n<p><br></p>",
    "link": "https://connecterra.recruitee.com/o/office-manager-personal-assistant"
}
]