[
{
    "id": "job-1167745",
    "title": "UX Designer",
    "company": "connecterra",
    "department": "Product",
    "location": "Amsterdam, Netherlands",
    "description": "<div><p><strong>You’re our UX Designer </strong></p></div>\n<div><p>So you want to rewire humankind’s relationship with nature through design? Awesome, then we’re looking for you to be our next UX Designer and become an essential part of our multidisciplinary Product Team.  </p></div>\n<div><p><br></p></div>\n<div><p>You’ll get to define and design the future of our Ida products, an artificially intelligent assistant for dairy focused enterprises, farmers and advisors. While we’ve been around for a while, we’re always exploring new grounds. This means every day will be different from the day before and you’ll have to effectively adapt to any given situation, as you do at a start-up. Additional advantage is it also means that there’ll be plenty of room for you to showcase your intrapreneurial mindset.  </p></div>\n<div><p><br></p></div>\n<div>\n<p>At Connecterra you’ll get to work with a wealth of data, which can get quite complex. It’ll be up to you to apply your user centered design methods to turn that complexity into the simplicity that makes Ida the true cutting-edge digital assistant for today and tomorrow’s farmers. Of course, we’re not just aiming to grow our product and business. You’ll be one of our most important assets, so we foster an environment of continuous personal growth. We want to offer you a platform to do the best work of your life (so far)! </p>\n<p><br></p>\n<div><p><strong>Your key responsibilities</strong></p></div>\n<div>\n<div><p>The following responsibilities you’ll share with our Lead Product Designer. You’ll be: </p></div>\n<div><ul>\n<li>Discovering user needs, jobs, pain points and opportunities  </li>\n<li>Understanding and creating user journeys and flows </li>\n<li>Organizing and facilitating (design) workshops </li>\n<li>Design and build (digital) prototypes</li>\n<li>Executing and coordinating usability testing</li>\n<li>Maintaining, using and extending our design system</li>\n<li>Advocating the users’ voice while working with development</li>\n<li>Operating as an effective and efficient team-player</li>\n</ul></div>\n</div>\n</div>",
    "requirements": "<div>\n<div><p><strong>Minimum qualifications</strong> </p></div>\n<div><ul>\n<li>You’ve got &gt; 2 years of professional experience in a similar role </li>\n<li>You’ve got a Bachelor’s or Master’s degree in design or a related discipline </li>\n<li>You’ve got a portfolio of relevant (professional) design work you’re proud of </li>\n<li>You’re familiar with industry standard design tooling (e.g. Figma)</li>\n<li>You’re fluent in written and spoken English</li>\n<li>You're able to show us a portfolio that you're really proud of</li>\n</ul></div>\n</div>\n<div>\n<div><p><br></p></div>\n<div><p><strong>We offer</strong> </p></div>\n<div><p>Every day we work hard on making the world a better place, thus the happiness and well-being of our team members is important to us. We currently offer the following: </p></div>\n<div><ul>\n<li>A diverse, open minded and creative working environment where all are welcome</li>\n<li>Competitive package</li>\n<li>Monthly wellbeing allowance</li>\n<li>Working from home allowance</li>\n<li>Pension</li>\n<li>Hybrid working environment</li>\n<li>Flexible working hours and vacation policy</li>\n<li>Quarterly company-wide Selfie Day</li>\n<li>The opportunity to play a vital role in an exciting start-up - we welcome your voice &amp; input</li>\n</ul></div>\n</div>\n<div>\n<p>As we grow as a company this list will also grow. </p>\n<p><br></p>\n<div><p><strong>About </strong><strong>Connecterra </strong></p></div>\n<div><p>Connecterra is a diverse team of pioneers working to solve one of the hardest challenges the planet faces today: Agriculture Efficiency. We are the proud inventors of Ida, a digital assistant for farmers that uses data and machine learning to help support farmers and their stakeholders improve farm efficiency. <br> </p></div>\n<div><p>Ida has demonstrated that she can help improve productivity by over 20% and is growing rapidly. Learn more about Ida <a href=\"https://ida.io/\" target=\"_blank\" rel=\"noopener\">here</a>. Headquartered in Amsterdam, The Netherlands, we operate in 18 countries globally. Check out our <a href=\"https://www.connecterra.io/downloads/\" target=\"_blank\" rel=\"noopener\">press coverage</a> and I<a href=\"https://ida.io/stories/\" target=\"_blank\" rel=\"noopener\">da growth track record</a>. <br> </p></div>\n<div><p><strong><br>Our hiring ethos</strong> <br>We seek only the best and brightest who have a hunger to excel in their craft and will make a positive &amp; unique addition to our culture and team. Your attitude and commitment to working as a part of this team to come up with new ideas, solve problems and deliver results is what matters most to us. </p></div>\n<div><p><br></p></div>\n<div><p>Our team is highly motivated, engaging, fun and supportive. We work as a team but hold each other accountable to our responsibilities. We offer you a platform to do the best work of your life, be involved with an interesting product and part of a unique, diverse and collaborative environment, your genuine desire to be an integral part of our mission means a lot to us.</p></div>\n</div>",
    "link": "https://connecterra.recruitee.com/o/ux-designer-amsterdam"
}